{
    "The Peacemaker": "The Peacemaker",
    "Moderate your repositories": "Moderate your repositories",
    "keeps your GitHub community civil": "keeps your GitHub community civil",
    "A non-intrusive Github bot that helps you manage your repositories issues and pull requests with AI-powered moderation.": "A non-intrusive Github bot that helps you manage your repositories issues and pull requests with AI-powered moderation.",
    "Ease Installation": "Ease Installation",
    "To get the bot working in your repository all you need to do is install it on Github Marketplace.": "To get the bot working in your repository all you need to do is install it on Github Marketplace.",
    "GitHub Integration": "GitHub Integration",
    "You can access your incivilized comments and repositories analysis by logging in with your Github account.": "You can access your incivilized comments and repositories analysis by logging in with your Github account.",
    "Fast and Simple": "Fast and Simple",
    "The bot is very easy to use and doesn't require any configuration, with the analysis of the comments starting automatically.": "The bot is very easy to use and doesn't require any configuration, with the analysis of the comments starting automatically.",
    "No intrusive politics": "No intrusive politics",
    "The bot doesn't interfere with your comments.": "O bot não interfere com seus comentários.",
    "Our": "Our",
    "Team": "Team",
    "We are a team of developers who are passionate about creating tools that help people manage their repositories issues and pull requests.": "We are a team of developers who are passionate about creating tools that help people manage their repositories issues and pull requests.",
    "We are a team of passionate and dedicated individuals who are committed to making a positive impact on the world through their work. We believe in the power of technology to bring people together and create a better future.": "We are a team of passionate and dedicated individuals who are committed to making a positive impact on the world through their work. We believe in the power of technology to bring people together and create a better future.",
    "Go to incivilities page": "Go to incivilities page",
    "Sign in": "Sign in",
    "Incivilities": "Incivilities",
    "English": "English",
    "Filter": "Filter",
    "Categories": "Categories",
    "All": "All",
    "Resolved": "Resolved",
    "Frustration": "Frustration",
    "Mockery": "Mockery",
    "Irony": "Irony",
    "Insult": "Insult",
    "Vulgarity": "Vulgarity",
    "Identity Attack": "Identity Attack",
    "Entitlement": "Entitlement",
    "Impatience": "Impatience",
    "Threat": "Threat",
    "Neutral": "Neutral",
    "Show details": "Show details",
    "Original Comment": "Original Comment",
    "Correction Suggestions": "Correction Suggestions",
    "Reply on GitHub": "Reply on GitHub",
    "Hide details": "Hide details",
    "days": "days",
    "Personal Correction": "Personal Correction",
    "Comment Details": "Comment Details",
    "Recent Flagged Comments": "Recent Flagged Comments",
    "The most recent flagged comments": "The most recent flagged comments",
    "Select period": "Select period",
    "User": "User",
    "Repository": "Repository",
    "Open Issues": "Open Issues",
    "Open Pull Requests": "Open Pull Requests",
    "Toxicity Score": "Toxicity Score",
    "Related issue": "Related issue",
    "DATE": "DATE",
    "Edited Comment": "Edited Comment",
    "No comments found": "No comments found",
    "Repositories": "Repositories",
    "Average Comment Score": "Average Comment Score",
    "Median Comment Score": "Median Comment",
    "Total Comments": "Total Comments",
    "Average score of all comments": "Average score of all comments",
    "Median score of all comments": "Median score of all comments",
    "Total number of comments posted": "Total number of comments posted",
    "Resolved Comments": "Resolved Comments",
    "Total number of comments resolved": "Total number of comments resolved",
    "Issues Incivility Over Time": "Issues Incivility Over Time",
    "Incivilized comments on issues": "Incivilized comments on issues",
    "Incivilized comments on pull requests": "Incivilized comments on pull requests",
    "Incivilized comments on issues and pull requests": "Incivilized comments on issues and pull requests",
    "Moderation Activity": "Moderation Activity",
    "Pull Request Incivility Over Time": "Pull Request Incivility Over Time",
    "Incivilized comments on pull requests": "Incivilized comments on pull requests",
    "Comments and Flags over time": "Comments and Flags over time",
    "Recent Flagged Comments": "Recent Flagged Comments",
    "The most recent flagged comments": "The most recent flagged comments",
    "Incivility Categories": "Incivility Categories",
    "Distribution by classification": "Distribution by classification",
    "Moderation Actions": "Moderation Actions",
    "Distribution of actions taken": "Distribution of actions taken",
    "Ajuda & Onboarding do Peacemaker Bot": "Help & Onboarding of Peacemaker Bot",
    "Aprenda, passo a passo, como começar a usar o": "Learn, step by step, how to start using the",
    "para monitorar e manter a civilidade nos seus repositórios GitHub.": "to monitor and keep the civility in your repositories GitHub.",
    "1. Instalar o Bot no GitHub": "1. Install the Bot on GitHub",
    "O primeiro passo é adicionar o Peacemaker Bot como um GitHub App no seu repositório:": "The first step is to add the Peacemaker Bot as a GitHub App to your repository:",
    "Clique no link de instalação:": "Click on the installation link:",
    "Autentique-se no GitHub e escolha o(s) repositório(s) onde o bot terá permissão para atuar.": "Sign in to GitHub and choose the repository(ies) where the bot will have permission to act.",
    "Dica você pode instalar em mais de um repositório, mas lembre-se de escolher apenas aqueles que deseja monitorar.": "Tip you can install in more than one repository, but remember to choose only those you want to monitor.",
    "2. Primeiro comentário incivilizado": "2. First incivilized comment",
    "Assim que alguém (inclusive você!) fizer um comentário com linguagem considerada incivilizada num dos repositórios permitidos, o bot irá:": "As soon as someone (including you!) makes a comment with language considered incivilized in one of the allowed repositories, the bot will:",
    "Detectar o comentário e calcular um score de toxicidade.": "Detect the comment and calculate a toxicity score.",
    "Classificar o comentário como incivil ou civil.": "Classify the comment as incivil or civil",
    "Gerar sugestões de reformulação para tornar o texto mais amigável.": "Generate suggestions to make the text more friendly.",
    "Exibir, na aba Incivilities, o comentário original, a classificação de incivilidade e as sugestões.": "Display, in the Incivilities tab, the original comment, the incivility classification and the suggestions.",
    "Na aba Incivilities, você tem três opções para cada sugestão:": "In the Incivilities tab, you have three options for each suggestion:",
    "Aceitar": "Accept",
    "Editar": "Edit",
    "Recusar": "Reject",
    "confirma a sugestão e substitui o texto no GitHub.": "confirms the suggestion and replaces the text in GitHub.",
    "ajusta a sugestão manualmente antes de aplicar.": "adjusts the suggestion manually before applying.",
    "descarta aquela sugestão e gera uma nova.": "discards that suggestion and generates a new one.",
    "3. Configurando seu Token Pessoal do GitHub": "3. Configuring your Personal GitHub Token",
    "Antes de aceitar qualquer sugestão automática, você precisa fornecer um Personal Access Token (PAT) do GitHub com permissão para modificar comentários. Sem ele, o bot não conseguirá substituir o texto.": "Before accepting any automatic suggestion, you need to provide a Personal Access Token (PAT) from GitHub with permission to modify comments. Without it, the bot will not be able to replace the text.",
    "Acesse sua conta no GitHub e vá em: Settings Developer settings  Personal access tokens.": "Access your GitHub account and go to: Settings Developer settings  Personal access tokens.",
    "Clique em Generate new token e selecione o escopo repo (ou apenas public_repo, se for um repositório público).": "Click on Generate new token and select the scope repo (or just public_repo, if it is a public repository).",
    "Copie o token gerado e salve-o em um local seguro.": "Copy the generated token and save it in a secure location.",
    "No painel do Peacemaker Bot, abra Configurações (ícone de engrenagem no perfil) e cole seu token.": "In the Peacemaker Bot panel, open Settings (gear icon in the profile) and paste your token.",
    "4. Edição de sugestões & reavaliação": "4. Editing suggestions & reevaluation",
    "Quando você edita e submete uma sugestão:": "When you edit and submit a suggestion:",
    "O bot reanalisa o texto editado em busca de traços de incivilidade.": "The bot reanalyzes the edited text in search of traces of incivility.",
    "Existem dois caminhos possíveis:": "There are two possible paths:",
    "A. Ainda incivilizado": "A. Still incivilized",
    "B. Resolvido": "B. Resolved",
    "Você vê um alerta informando que o texto ainda não está ok.": "You see an alert indicating that the text is not yet ok.",
    "Novas sugestões são geradas para melhorar novamente.": "New suggestions are generated to improve again.",
    "Se, após duas edições, ainda houver incivilidade, o bot para de sugerir e exibe um alerta final.": "If, after two edits, there is still incivility, the bot stops suggesting and displays a final alert.",
    "O bot não detecta mais incivilidade e marca o comentário como resolvido.": "The bot no longer detects incivility and marks the comment as resolved.",
    "Parabéns! A conversa está num tom saudável.": "Congratulations! The conversation is in a healthy tone.",
    "Atenção: esse fluxo evita que você fique num ciclo infinito de edições sem sair do lugar.": "Attention: this flow prevents you from getting stuck in an infinite cycle of edits without leaving the place.",
    "5. Explorando a Dashboard": "5. Exploring the Dashboard",
    "Por fim, visite a": "Finally, visit the",
    "Dashboard": "Dashboard",
    "para acompanhar métricas e relatórios:": "to monitor and keep the civility in your repositories GitHub.",
    "Filtros de período": "Period filters",
    "Escolha entre últimos 24h, 7d e 30d.": "Choose between the last 24h, 7d and 30d.",
    "Visão geral": "Overview",
    "Cartões com média/mediana de toxicidade, total de comentários, itens resolvidos, etc.": "Cards with average/median toxicity, total comments, resolved items, etc.",
    "Gráficos interativos": "Interactive graphs",
    "Atividade de moderação, incivilidades por tipo, categorias e ações tomadas.": "Moderation activity, incivilities by type, categories and actions taken.",
    "Pronto para começar?": "Ready to start?",
    "Filtro por repositório": "Repository filter",
    "Se algo ainda não ficou claro, volte aqui ou abra um issue no próprio repositório do bot. Estamos sempre melhorando!": "If something is still unclear, come back here or open an issue in the bot's own repository. We are always improving!",
    "Bom trabalho e feliz moderação!": "Good work and happy moderation!",
    "Foque em um projeto específico ou visualize todos de uma vez.": "Focus on a specific project or visualize all at once.",
    "Use esses dados para entender tendências, treinar sua equipe e manter a comunidade engajada num ambiente respeitoso.": "Use these data to understand trends, train your team and keep the community engaged in a respectful environment.",
    "2. Configurando seu LLM": "2. Configuring your LLM",
    "Para começar a usar o Peacemaker Bot, você precisa configurar um LLM (Large Language Model) de sua preferência. Siga estes passos:": "To start using the Peacemaker Bot, you need to configure an LLM (Large Language Model) of your preference. Follow these steps:",
    "Acesse seu perfil": "Access your profile",
    "Clique na sua foto de perfil no canto superior direito da tela.": "Click on your profile picture in the top right corner of the screen.",
    "Selecione o LLM": "Select LLM",
    "No menu que aparece, clique em 'Selecionar LLM' para configurar seu modelo preferido.": "In the menu that appears, click on 'Select LLM' to configure your preferred model.",
    "Configurando OpenAI": "Configuring OpenAI",
    "Configurando Groq": "Configuring Groq",
    "Acesse": "Access",
    "Faça login na sua conta OpenAI": "Log in to your OpenAI account",
    "Clique em 'Create new secret key'": "Click on 'Create new secret key'",
    "Dê um nome para sua chave e copie o token gerado": "Give a name to your key and copy the generated token",
    "Cole o token no campo correspondente no Peacemaker Bot": "Paste the token in the corresponding field in the Peacemaker Bot",
    "Faça login na sua conta Groq": "Log in to your Groq account",
    "Clique em 'Create API Key'": "Click on 'Create API Key'",
    "Importante: Mantenha seu token em segurança e nunca o compartilhe. Se você suspeitar que seu token foi comprometido, revogue-o imediatamente e gere um novo.": "Important: Keep your token secure and never share it. If you suspect your token has been compromised, revoke it immediately and generate a new one.",
    "4. Configurando seu Token Pessoal do GitHub": "4. Configuring your Personal GitHub Token",
    "5. Edição de sugestões & reavaliação": "5. Editing suggestions & reevaluation"
}
